# Unregister Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtElemChangeBeamSectionRegistry..::..Unregister Method
ExtElemChangeBeamSectionRegistry Class See Also
---
Unregisters IExtElemChangeBeamSection.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static void Unregister()
```

Visual Basic
---
```text
Public Shared Sub Unregister
```

Visual C++
---
```text
public:
static void Unregister()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no valid Connections Provider registered. |

# See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace